enginsubasi/Udemy_STM32/Projects/15-HC-SR04/TestFirstProject/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ACC_CS_Pin GPIO_PIN_3
#define ACC_CS_GPIO_Port GPIOE
#define USER_BUTTON_Pin GPIO_PIN_0
#define USER_BUTTON_GPIO_Port GPIOA
#define ECHO_Pin GPIO_PIN_1
#define ECHO_GPIO_Port GPIOA
#define ECHO_EXTI_IRQn EXTI1_IRQn
#define TRIG_Pin GPIO_PIN_2
#define TRIG_GPIO_Port GPIOA
#define GREEN_YN_Pin GPIO_PIN_12
#define GREEN_YN_GPIO_Port GPIOD
#define ORANGE_XP_Pin GPIO_PIN_13
#define ORANGE_XP_GPIO_Port GPIOD
#define RED_YP_Pin GPIO_PIN_14
#define RED_YP_GPIO_Port GPIOD
#define BLUE_XN_Pin GPIO_PIN_15
#define BLUE_XN_GPIO_Port GPIOD
#define AUD_RST_Pin GPIO_PIN_4
#define AUD_RST_GPIO_Port GPIOD
#define ACC_INT_1_Pin GPIO_PIN_0
#define ACC_INT_1_GPIO_Port GPIOE
#define ACC_INT_1_EXTI_IRQn EXTI0_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
